app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Testtttttt"], ["body", "test"], ["created_at", "2024-05-17 16:27:44.339401"], ["updated_at", "2024-05-17 16:27:44.339401"], ["status", "public"], ["user_id", 1]]