app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 33], ["id", 8], ["LIMIT", 1]]
---
  def show
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])